<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current version of Splashtop streamer. Set DEPLOY_CODE with your deploy code. Set PLIST_PERM to your desired chmod permissions for the plashtop-Streamer.plist. Permissions on the Splashtop-Streamer.plist are installed as 666, any user can change and delete settings. Set HIDE_FOLDER "hidden" to hide the /Users/Shared/Splashtop folder and "nohidden" to keep the default visibility.</string>
		<key>Identifier</key>
		<string>com.github.peetinc.munki.SplashtopStreamer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SplashtopStreamer</string>
			<key>DISPLAY_NAME</key>
			<string>Splashtop Streamer</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Splashtop</string>
			<key>MUNKI_CATEGORY</key>
			<string>Support</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Splashtop</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Splashtop Business Access provides fast, simple, secure remote computer access for individuals and teams. With it you can access computers remotely from any device.</string>
			<key>DEPLOY_CODE</key>
			<string>-REPLACE-ME-</string>
			<key>PLIST_PERM</key>
			<string>664</string>
			<key>HIDE_FOLDER</key>
			<string>hidden</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%DISPLAY_NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>blocking_applications</key>
				<array/>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
				<key>preinstall_script</key>
				<string>#!/bin/bash

#Script to create /Users/Shared/SplashtopStreamer/.PreInstall with appropriate variables.
#If /Users/Shared/SplashtopStreamer/.PreInstall is in place when splashtop package is installed then it will be correctly deployed

if [ -f "/Users/Shared/SplashtopStreamer/Splashtop-Streamer.plist" ]; then
  echo "Splashtop Streamer settings exist. Skipping deployment"
  exit 0
fi

if [ ! -d /Users/Shared/SplashtopStreamer ]; then
  mkdir -p /Users/Shared/SplashtopStreamer;
  chmod -R 777 /Users/Shared/SplashtopStreamer
fi

#Do not install Soundflower driver. This helps with deployment via Munki.
#Installing Soundflower driver will hang if the Mac has no users logged in at the time of deployment.
Install_Driver=false

EulaAccepted=true
HidePreferenceDomainSelection=true

#ShowDeployMode must be true to attempt to deploy
ShowDeployMode=true
SplashtopAccount=""
DeployCode="%DEPLOY_CODE%"

#show deploy warning
ShowDeployLoginWarning=false

# This will be the name of the computer in Splashtop UI, not the computer hostname. Will be set to mac name by default
#ComputerName=`scutil --get ComputerName`
#HostName="$ComputerName"
HostName="`scutil --get ComputerName`"

# Request permission to connect (0:off, 1:reject after request expires, 2:connect after request expires).
EnablePermissionProtection=0

#Require additional password to connect EnableOSCredential to require macOS account auth"
init_security_code=""
EnableSecurityCodeProtection=false
EnableOSCredential=true

#loopback connection only
LegacyConnectionLoopbackOnly=false

#Hide Menubar icon
HideTrayIcon=false

#Default client name on connection bubble.
DefaultClientDeviceName=""

#Do NOT show Streamer UI after installation both need to be false
FirstTimeClose=false
FirstTimeLogin=false

if [ "$Install_Driver" == false ]; then
No_Driver="/Users/Shared/SplashtopStreamer/.NoDriver"
touch "$No_Driver"
echo NO DRIVER
fi

/usr/libexec/PlistBuddy -c "Add Common:EulaAccepted bool $EulaAccepted" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add Common:HidePreferenceDomainSelection bool $HidePreferenceDomainSelection" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:ShowDeployLoginWarning bool $ShowDeployLoginWarning" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:ShowDeployMode bool $ShowDeployMode" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:SplashtopAccount string $SplashtopAccount" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:DeployCode string $DeployCode" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:DeployTeamNameCache string" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:DeployTeamOwnerCache string" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:LastDeployCode string" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:TeamCode string" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:TeamCodeInUse string" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:HostName string $HostName" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:EnablePermissionProtection integer $EnablePermissionProtection" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:init_security_code string $init_security_code" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:EnableSecurityCodeProtection bool $EnableSecurityCodeProtection" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:EnableOSCredential bool $EnableOSCredential" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:LegacyConnectionLoopbackOnly bool $LegacyConnectionLoopbackOnly" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:HideTrayIcon bool $HideTrayIcon" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:DefaultClientDeviceName string $DefaultClientDeviceName" /Users/Shared/SplashtopStreamer/.PreInstall

/usr/libexec/PlistBuddy -c "Add STP:FirstTimeClose bool $FirstTimeClose" /Users/Shared/SplashtopStreamer/.PreInstall
/usr/libexec/PlistBuddy -c "Add STP:FirstTimeLogin bool $FirstTimeLogin" /Users/Shared/SplashtopStreamer/.PreInstall

exit 0
				</string>
				<key>postinstall_script</key>
				<string>#!/bin/bash

#Splashtop runs as user, so the settings plist permissions are 666. Any user could delete the plist or change settings,
#even if changing settings is denied by your Splashtop deployment policy. So chown root:admin, chmod 644, chmod +a "everyone deny delete"

if [ -f "/Users/Shared/SplashtopStreamer/Splashtop-Streamer.plist" ]; then
  echo "Securing /Users/Shared/SplashtopStreamer/Splashtop-Streamer.plist"
  chown root:admin /Users/Shared/SplashtopStreamer/Splashtop-Streamer.plist
  chmod %PLIST_PERM% /Users/Shared/SplashtopStreamer/Splashtop-Streamer.plist
  chmod +a "everyone deny delete" /Users/Shared/SplashtopStreamer/Splashtop-Streamer.plist
fi

chflags %HIDE_FOLDER% /Users/Shared/SplashtopStreamer

exit 0
			</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.peetinc.download.SplashtopStreamer</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%/*.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/tmp/PKGs</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/tmp/PKGs/Splashtop_Streamer-installer.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/tmp/payload/Applications/</string>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/tmp/payload</string>
					<key>installs_item_paths</key>
					<array>
						<string>/Applications/Splashtop Streamer.app</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>force_munkiimport</key>
					<false/>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/tmp/</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>