<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Splashtop Streamer.</string>
		<key>Identifier</key>
		<string>com.github.peetinc.download.SplashtopStreamer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SplashtopStreamer</string>
			<key>SPARKLE_FEED_URL</key>
			<string>https://sn.splashtop.com/file_system/apt_repository/dists/STRA01/released/binary-i386/en.appcast.xml</string>
		</dict>
		<key>MiniumumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>%SPARKLE_FEED_URL%</string>
				</dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Splashtop Streamer.pkg</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Splashtop Inc. (CPQQ3AW49Y)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
