<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Universal version of Cursor.

Possible values for PLATFORM include:
- darwin-universal (default)
- darwin (Intel only)
- darwin-arm64 (Apple Silicon only)
- win32-x64
- win32-arm64
- win32-x64-user
- win32-arm64-user
- linux-x64
- linux-arm64

Possible values for RELEASETRACK include:
- stable (default)
- latest
</string>
	<key>Identifier</key>
	<string>com.github.peetinc.download.Cursor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cursor</string>
		<key>PLATFORM</key>
		<string>darwin-universal</string>
		<key>RELEASETRACK</key>
		<string>stable</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"downloadUrl":"(https[^"]+\.dmg)"</string>
				<key>url</key>
				<string>https://www.cursor.com/api/download?platform=%PLATFORM%&amp;releaseTrack=%RELEASETRACK%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Cursor.app</string>
				<key>requirement</key>
				<string>identifier "com.todesktop.230313mzl4w4u92" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VDXQ22DGB9</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Cursor.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
