<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Rectangle and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.Rectangle</string>
	<key>Input</key>
	<dict>
		<key>DERIVE_MIN_OS</key>
		<string>true</string>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/RyanHanson</string>
		<key>NAME</key>
		<string>Rectangle</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array/>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>description</key>
			<string>&lt;a href=https://rectangleapp.com/&gt;Rectangle&lt;/a&gt;: Move and resize windows in macOS using keyboard shortcuts or snap areas.</string>
			<key>developer</key>
			<string>Ryan Hanson</string>
			<key>display_name</key>
			<string>Rectangle</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preinstall_script</key>
			<string>#!/bin/bash 
				
AppName="Rectangle"
AppPath="/Applications/$AppName.app"
ConsoleUSER=$(stat -f "%Su" /dev/console)
RestartApp="/Users/Shared/.Restart$AppName"

if [ -f $RestartApp ]; then
	rm $RestartApp
fi

if ( pgrep "$AppName" ) then
sudo -u $ConsoleUSER /usr/bin/osascript &lt;&lt;AppleScript
	quit app "$AppName"
AppleScript
sleep 3
killall "$AppName" &gt; /dev/null 2&gt;&amp;1
touch $RestartApp
fi

exit 0</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash 
				
AppName="Rectangle" 
AppPath="/Applications/$AppName.app" 
ConsoleUSER=$(stat -f "%Su" /dev/console) 
RestartApp="/Users/Shared/.Restart$AppName"

if [ -f $RestartApp ]; then
	su "$ConsoleUSER" -c "open -a $AppPath"
	rm $RestartApp
fi

exit 0</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.Rectangle</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>derive_minimum_os_version</key>
				<string>%DERIVE_MIN_OS%</string>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/%NAME%.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
