<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of RingCentral Meetings and builds a package.
	This recipe differs from the ones in homebysix-recipes in the following ways:
	- This one does not repackage the downloaded pkg
		</string>
		<key>Identifier</key>
		<string>com.github.peetinc.pkg.RingCentralMeetings</string>
		<key>Input</key>
		<dict>
			<key>BUNDLE_ID</key>
			<string>us.zoom.ringcentral</string>
			<key>NAME</key>
			<string>RingCentralMeetings</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.1</string>
		<key>ParentRecipe</key>
		<string>com.github.homebysix.download.RingCentralMeetings</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/expanded</string>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/expanded/install.pkg/Payload</string>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/RingCentral Meetings.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/RingCentralMeetings-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>PkgCopier</string>
			</dict>
		</array>
	</dict>
</plist>
