<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of LogitechOptions Installer and pulls package from .app installer.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.pkg.LogitechOptions</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.logitech.manager.installer</string>
		<key>NAME</key>
		<string>LogitechOptions</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.LogitechOptions</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/LogiMgrInstaller.app/Contents/Resources/LogiMgr.mpkg</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/LogitechOptions-%version%.mpkg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
	</array>
</dict>
</plist>
