<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Logitech Options and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.GarminBaseCamp</string>
	<key>Input</key>
	<dict>
		<key>DEVELOPER</key>
		<string>Garmin</string>
		<key>NAME</key>
		<string>GarminBaseCamp</string>
		<key>DISPLAY_NAME</key>
		<string>Garmin BaseCamp</string>
		<key>CATEGORY</key>
		<string>Maps</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%DEVELOPER%/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Garmin BaseCamp is a 3D mapping application that allows you to transfer Garmin Custom Maps, BirdsEye Imagery, waypoints, tracks, and routes between your Mac and Garmin device. It allows you to manage your data on practically all Garmin map products, but topographic maps are required for 3-D rendering.</string>
			<key>developer</key>
			<string>%DEVELOPER%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.GarminBaseCamp</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Install BaseCamp.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Install BaseCamp_pkg</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
                <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/Install BaseCamp_pkg/garminBaseCamp.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Garmin BaseCamp.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
    	</dict>
		<dict>
			<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Garmin BaseCamp.app</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleVersion</key>
						<string>VERSION</string>
						<key>LSMinimumSystemVersion</key>
						<string>MIN_OS_VER</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PlistReader</string>
		</dict>
		<dict>
     	<key>Arguments</key>
        <dict>
            <key>additional_pkginfo</key>
            <dict>
				<key>version</key>
				<string>%VERSION%</string>
				<key>minimum_os_version</key>
				<string>%MIN_OS_VER%</string>
			</dict>
		</dict>
		<key>Processor</key>
        <string>MunkiPkginfoMerger</string>
   		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
