<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Kerio Control VPN Client</string>   
    <key>Identifier</key>
    <string>com.github.peetinc.download.KerioControlVPNClient</string> 
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KerioControlVPNClient</string>
        
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://download.kerio.com/dwn/kerio-control-vpnclient-mac.dmg</string>
				<key>curl_opts</key>
				<array>
					<string>--location</string>
				</array>
				<key>filename</key>
				<string>%NAME%.dmg</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Kerio Control VPN Client Installer.pkg</string>
        	</dict>
    	</dict>
    </array>
</dict>
</plist>