<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Please mind the postinstall_script. It creates a hands-off experience for endusers, but my not suite your needs.</string>
	<key>Description</key>
	<string>Downloads the latest version of RWTS-PDFwriter and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.RWTS-PDFwriter</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Printing</string>
		<key>MIN_OS</key>
		<string>11.0</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>RWTS-PDFwriter</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>PDFWriter Utility.app</string>
			</array>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A print to pdf-file printer driver.</string>
			<key>developer</key>
			<string>Real World Technology Solutions Pty Ltd</string>
			<key>display_name</key>
			<string>RWTS-PDFwriter</string>
			<key>minimum_os_version</key>
			<string>%MIN_OS%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash

loggedInUser=$( scutil &lt;&lt;&lt; "show State:/Users/ConsoleUser" | awk '/Name :/ &amp;&amp; ! /loginwindow/ { print $3 }' )
iconSource=/Library/Printers/RWTS/PDFwriter/PDFfolder.png
iconDestination=/var/spool/pdfwriter/$loggedInUser
icon=/tmp/`basename $iconSource`
rsrc=/tmp/icon.rsrc

if [ ! -d "/private/var/spool/pdfwriter/$loggedInUser" ]; then
  mkdir -p "/private/var/spool/pdfwriter/$loggedInUser"
  chown -R $loggedInUser:Staff "/private/var/spool/pdfwriter/$loggedInUser"
  chmod -R 700 "/private/var/spool/pdfwriter/$loggedInUser"
  chmod 755 "/private/var/spool/pdfwriter/"
fi

if [ -f $iconSource ]; then
    ###Ensure Custom icon is set before symlinking spool folder    
    # Create icon from the iconSource
    cp $iconSource $icon
    
    # Add icon to image file, meaning use itself as the icon
    sips -i $icon
    
    # Take that icon and put it into a rsrc file
    DeRez -only icns $icon &gt; $rsrc
    
    # Apply the rsrc file to
    SetFile -a C $iconDestination
    
    if [ -f $iconDestination ]; then
        # Destination is a file
        Rez -append $rsrc -o $iconDestination
    elif [ -d $iconDestination ]; then
        # Destination is a directory
        # Create the magical Icon\r file
        touch $iconDestination/$'Icon\r'
        Rez -append $rsrc -o $iconDestination/Icon?
        SetFile -a V $iconDestination/Icon?
    fi
    
    rm $rsrc $icon
fi

if [ -L /Users/$loggedInUser/Desktop/PDFWriter ];then 
  	rm /Users/$loggedInUser/Desktop/PDFWriter
fi

ln -s /private/var/spool/pdfwriter/$loggedInUser /Users/$loggedInUser/Desktop/PDFWriter

if [ -L "/Applications/Utilities/PDFWriter Utility.app" ];then 
rm -rf "/Applications/Utilities/PDFWriter Utility.app"
fi

ln -s "/Library/Printers/RWTS/Utilities/PDFWriter Utility.app" "/Applications/Utilities/PDFWriter Utility.app"</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash

rm -rf "/Applications/Utilities/PDFWriter Utility.app"</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_script</key>
			<string>#!/bin/sh

/Library/Printers/RWTS/PDFwriter/uninstall</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.RWTS-PDFwriter</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
