<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads NoMAD Login AD and imports into munki.
This recipe differs from the ones in bochoven-recipes in the following ways:
- This one adds pre/post install script variables
	</string>  
	<key>Identifier</key>
    <string>com.github.peetinc.munki.NoMADLoginAD</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NoMADLoginAD</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Orchard_and_Grove</string>
        <key>DISPLAY_NAME</key>
        <string>NoMAD Login AD</string>
        <key>MUNKI_CATEGORY</key>
        <string>Security</string>
        <key>PREINSTALL</key>
        <string>#!/bin/bash
exit 0</string>
		<key>POSTINSTALL</key>
        <string>#!/bin/bash
exit 0</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>NoMAD Login AD (NoLoAD) is a replacement login window for macOS 10.12 and higher.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Orchard &#038; Grove</string>
			<key>preinstall_script</key>
			<string>%PREINSTALL%</string>
			<key>postinstall_script</key>
			<string>%POSTINSTALL%</string>
			<key>preuninstall_script</key>
            <string>#!/bin/bash
/usr/local/bin/authchanger -reset
            </string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.peetinc.download.NoMADLoginAD</string>
    <key>Process</key>
        <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>