<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Setapp and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.Setapp</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Setapp</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>AppStore</string>
			<key>description</key>
			<string>Required Think tasks, not apps. Setapp membership gives you an all-access pass to curated Mac and iOS apps.</string>
			<key>developer</key>
			<string>Setapp</string>
			<key>display_name</key>
			<string>Setapp</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash

## Get logged in user and UID
currentUser=$( echo "show State:/Users/ConsoleUser" | scutil | awk '/Name :/ { print $3 }' )
currentUID=$(id -u $currentUser)

if [ -f /Users/Shared/.SetappRestart ]; then
	rm /Users/Shared/.SetappRestart 
	launchctl asuser $currentUID launchctl load /Users/$currentUser/Library/LaunchAgents/com.setapp.DesktopClient.*
fi

exit 0</string>
			<key>preinstall_script</key>
			<string>#!/bin/bash

## Get logged in user and UID
currentUser=$( echo "show State:/Users/ConsoleUser" | scutil | awk '/Name :/ { print $3 }' )
currentUID=$(id -u $currentUser)

if ( pgrep -q Setapp ); then
	touch /Users/Shared/.SetappRestart 
	launchctl asuser $currentUID launchctl unload /Users/$currentUser/Library/LaunchAgents/com.setapp.DesktopClient.*
fi

exit 0</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.Setapp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
