<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Splashtop SOS and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.peetinc.munki.SplashtopSOS</string>
    <key>Input</key>
    <dict>
      <key>APP_FILENAME</key>
      <string>Splashtop SOS</string>
      <key>DERIVE_MIN_OS</key>
      <string>true</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/%NAME%</string>
      <key>NAME</key>
      <string>SplashtopSOS</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>Download and run the SOS app to give your IT Admin remote access to this computer.</string>
        <key>developer</key>
        <string>Splashtop</string>
        <key>display_name</key>
        <string>Splashtop SOS</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>unattended_uninstall</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.peetinc.download.SplashtopSOS</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/pkgroot</string>
          <key>pkgdirs</key>
          <dict>
            <key>Applications</key>
            <string>0775</string>
          </dict>
        </dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%pathname%/%APP_FILENAME%.app</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%APP_FILENAME%.app</string>
        </dict>
        <key>Processor</key>
        <string>Copier</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>derive_minimum_os_version</key>
          <string>%DERIVE_MIN_OS%</string>
          <key>faux_root</key>
          <string>%RECIPE_CACHE_DIR%/pkgroot</string>
          <key>installs_item_paths</key>
          <array>
            <string>/Applications/%APP_FILENAME%.app</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
