<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of SyncroAgent and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.peetinc.munki.SyncroAgent</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>SyncroAgent</string>
			<key>CATEGORY</key>
			<string>SysAdmin</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>SyncroMSP Agent</string>
				<key>developer</key>
				<string>SyncroMSP</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>display_name</key>
				<string>SyncroAgent</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.peetinc.download.SyncroAgent</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>installs_item_paths</key>
					<array>
						<string>/Applications/SyncroAgent.app</string>
					</array>
					<key>version_comparison_key</key>
					<string>CFBundleVersion</string>
				</dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>app_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/SyncroAgent.app</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleVersion</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
