<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of Splashtop Business Access.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.SplashtopBusinessAccess</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SplashtopBusinessAccess</string>
		<key>DISPLAY_NAME</key>
		<string>Splashtop Business Access</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Splashtop</string>
		<key>MUNKI_CATEGORY</key>
		<string>Support</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Splashtop</string>
		<key>MUNKI_DESCRIPTION</key>
		<string>Install the Splashtop Business app on the Mac you want to remote from.</string>
		<key>MIN_OS</key>
		<string>10.7</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>%MUNKI_DESCRIPTION%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>%MIN_OS%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.SplashtopBusinessAccess</string>
	<key>Process</key>
	<array>
	<dict>
        <key>Arguments</key>
        <dict>
            <key>flat_pkg_path</key>
            <string>%pathname%/*.pkg</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/tmp/PKGs</string>
        </dict>
    	<key>Processor</key>
        <string>FlatPkgUnpacker</string>
    </dict>
	<dict>
	    <key>Arguments</key>
        <dict>
            <key>pkg_payload_path</key>
            <string>%RECIPE_CACHE_DIR%/tmp/PKGs/*.pkg/Payload</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/tmp/payload/Applications/</string>
         </dict>
         <key>Processor</key>
         <string>PkgPayloadUnpacker</string>
    </dict>
	<dict>
    	<key>Arguments</key>
        	<dict>
            	<key>faux_root</key>
            	<string>%RECIPE_CACHE_DIR%/tmp/payload</string>
            	<key>installs_item_paths</key>
            		<array>
                   		<string>/Applications/Splashtop Business.app</string>
               		</array>
            </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
    </dict>
    <dict>
    	<key>Processor</key>
        <string>MunkiPkginfoMerger</string>
    </dict>
    <dict>
     	<key>Arguments</key>
        <dict>
            <key>additional_pkginfo</key>
            <dict>
				<key>version</key>
				<string>%version%</string>
			</dict>
		</dict>
		<key>Processor</key>
        <string>MunkiPkginfoMerger</string>
    </dict>
    <dict>
        <key>Arguments</key>
	        <dict>
                <key>force_munkiimport</key>
                <false/>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        <key>Processor</key>
	    <string>MunkiImporter</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>path_list</key>
            <array>
                <string>%RECIPE_CACHE_DIR%/tmp/</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
    </dict>
	</array>
</dict>
</plist>