<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Privileges.app and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.github.peetinc.munki.privileges</string>
    <key>Input</key>
    <dict>
        <key>DERIVE_MIN_OS</key>
        <string>YES</string>
        <key>DESCRIPTION</key>
        <string>Privileges.app for macOS is designed to allow users to work as a standard user for day-to-day use, by providing a quick and easy way to get administrator rights when needed. When you do need admin rights, you can get them by clicking on the Privileges icon in your Dock.</string>
        <key>DISPLAYNAME</key>
        <string>Privileges</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>SAP</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Privileges</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array/>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>%DESCRIPTION%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%DISPLAYNAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash

# Adapted from pre-install script inside Privileges v2 pkg installer

# Current console user information
current_user=$(/bin/ls -l /dev/console | /usr/bin/awk '{ print $3 }')
current_user_uid=$(/usr/bin/id -u "${current_user}")
current_user_home=$(/usr/bin/dscl . read "/Users/${current_user}" NFSHomeDirectory | /usr/bin/cut -d' ' -f2)

# unload the agent plist
/bin/launchctl bootout gui/$(/usr/bin/id -u "$currentUser") /Library/LaunchAgents/corp.sap.privileges.agent.plist
/bin/sleep 2
/usr/bin/sudo -u "$currentUser" /usr/bin/killall "Privileges" "PrivilegesAgent" "PrivilegesCLI"

# unload the old helper
/bin/launchctl bootout system /Library/LaunchDaemons/corp.sap.privileges.helper.plist

# unload the daemon plist
/bin/launchctl bootout system /Library/LaunchDaemons/corp.sap.privileges.daemon.plist

# just for sure ...
/bin/sleep 2
/usr/bin/killall "corp.sap.privileges.helper" "PrivilegesDaemon"

# remove old stuff
/bin/rm -rf "/Library/LaunchDaemons/corp.sap.privileges.helper.plist"
/bin/rm -rf "/Library/LaunchAgents/corp.sap.privileges.plist"
/bin/rm -rf "/Library/PrivilegedHelperTools/corp.sap.privileges.helper"
/bin/rm -rf "/Applications/Privileges.app"
	
# Remove v2 files
# Ref: https://github.com/SAP/macOS-enterprise-privileges/wiki/Uninstallation
/bin/rm -rf "/Library/LaunchAgents/corp.sap.privileges.agent.plist"
/bin/rm -rf "/Library/LaunchDaemons/corp.sap.privileges.daemon.plist"
/bin/rm -rf "/Library/Preferences/corp.sap.PrivilegesDaemon.plist"
/bin/rm -rf "/Library/Scripts/VoiceOver/Privileges Time Left.scpt"
/bin/rm -rf "/private/etc/paths.d/PrivilegesCLI"
/bin/rm -rf "${current_user_home}/Library/Containers/corp.sap.privileges."*
/bin/rm -rf "${current_user_home}/Library/Application Scripts/corp.sap.privileges"*
/bin/rm -rf "${current_user_home}/Library/Group Containers/7R5ZEU67FQ.corp.sap.privileges"
/bin/rm -rf "${current_user_home}/Library/Preferences/corp.sap.privileges"*

pkgutil --forget com.sap.privileges /

exit 0</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.privileges</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/unpack/Privileges.pkg/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>derive_minimum_os_version</key>
                <string>%DERIVE_MIN_OS%</string>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Privileges.app</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/payload/Applications/Privileges.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>