<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>DEPRECATED: MacUpdater was discontinued on January 1, 2026.</string>
		<key>Identifier</key>
		<string>com.github.peetinc.munki.MacUpdater</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/CoreCode_Limited</string>
			<key>NAME</key>
			<string>MacUpdater</string>
			<key>CATEGORY</key>
			<string>Utilities</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>MacUpdater is an application that can scan your Mac and display which of the apps that you have installed are not up-to-date. MacUpdater can also update those outdated apps to their newest versions with a simple click.</string>
				<key>developer</key>
				<string>CoreCode Limited</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>display_name</key>
				<string>MacUpdater</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.peetinc.download.MacUpdater</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
